YanKE01/esp-iot-solution/components/sensors/sensor_hub/test_apps/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.3 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESP_TASK_WDT_EN=n
CONFIG_FREERTOS_HZ=1000
CONFIG_ULP_COPROC_ENABLED=y
CONFIG_ULP_COPROC_TYPE_LP_CORE=y
CONFIG_ULP_COPROC_RESERVE_MEM=15000
CONFIG_ULP_PANIC_OUTPUT_ENABLE=y
CONFIG_ESP_AMP_ENABLED=y
CONFIG_ESP_AMP_SUBCORE_TYPE_LP_CORE=y
CONFIG_ESP_AMP_HP_SHARED_MEM_SIZE=16384
CONFIG_ESP_AMP_RTC_SHARED_MEM_SIZE=256
CONFIG_ESP_AMP_SUBCORE_USE_HP_MEM_SIZE=16384
CONFIG_ESP_AMP_SUBCORE_STACK_SIZE_MIN=1024
CONFIG_ESP_AMP_EVENT_TABLE_LEN=8
CONFIG_ESP_AMP_SW_INTR_HANDLER_TABLE_LEN=8
CONFIG_ESP_AMP_SYSTEM_ENABLE_SUPPLICANT=y
CONFIG_ESP_AMP_ROUTE_SUBCORE_PRINT=y
